app/controllers/admin/access_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def index
    @preference = Preference.first_or_create(allow_create_artists: true, allow_create_songs: true)

SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "preferences" SET "allow_create_songs" = ?, "allow_create_artists" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["allow_create_songs", "f"], ["allow_create_artists", "t"], ["updated_at", "2016-02-02 00:17:49.602109"], ["id", 1]]
---
  def update
    @preference = Preference.find(params[:id])
    @preference.update(pref_access_params)