app/controllers/artists_controller.rb

  def index
    pref = Preference.first_or_create(artist_sort_order: "DESC")
    pref.artist_sort_order = "DESC" if pref.artist_sort_order.blank?
    @artists = Artist.all.order(name: pref.artist_sort_order)
---
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
SELECT "artists".* FROM "artists"
SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" DESC

  def new
    preference = Preference.first
---
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1